# The following file will install all of the listed software below using brew.
#
# How to run:
#   0. Make sure you have installed Brew: https://brew.sh/
#   1. Download this Brewfile and save it somewhere.
#   2. Navigate to the folder where the Brewfile resides.
#   3. Run "brew bundle" in the same folder, and it will run the Brewfile and install all the applications.


# Add additional repositories that are not in the official Brew formulae.
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "stacc/tap"

# Install the following software.
brew "awscli"
brew "azure-cli"
brew "coreutils"
brew "direnv"
brew "helm"
brew "helmfile"
brew "jq"
brew "kubernetes-cli"
brew "kubectx"
brew "kubeseal"
brew "minikube"
brew "node"
brew "nvm"
brew "tree"
brew "watch"
brew "yarn"
brew "stacc/tap/stacc-next"

# Install Mac specific applications.
cask "flameshot"
cask "google-chrome"
cask "spotify"
cask "camunda"
