# TAPS
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-fonts"

# FONTS
cask "font-fira-code-nerd-font" # Programming ligatures

# BINARIES
brew "gh" # GitHub CLI
brew "node" # Node.js
brew "fnm" # Node version manager
brew "helm" # Kubernetes package manager
brew "helmfile" # Helm wrapper for templating and sharing k8s manifests.
brew "kubectl" # Kubernetes CLI
brew "stern" # Kubernetes log viewer
brew "kubectx" # Switch between k8s contexts
brew "gnupg" # GPG

# APPLICATIONS
cask "cursor" # Code Editor of choice
cask "orbstack" # Run containers
cask "postman" # API testing
cask "bruno" # API testing
cask "1password" # Password manager
cask "1password-cli" # Password manager CLI
cask "slack" # Business chat
cask "discord" # Chat
cask "flameshot" # Screenshot tool
cask "spotify" # Music


